-----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/annajensen/Documents/GitHub/PB4A7_Practice/Seminar_4/Seminar_3.log
  log type:  text
 opened on:  30 Oct 2024, 14:59:59

. 
. use Seminar_4, clear

. 
. *Question 1*
. reg birthweight smoker

      Source |       SS           df       MS      Number of obs   =     3,000
-------------+----------------------------------   F(1, 2998)      =     88.28
       Model |    30080336         1    30080336   Prob > F        =    0.0000
    Residual |  1.0215e+09     2,998  340740.383   R-squared       =    0.0286
-------------+----------------------------------   Adj R-squared   =    0.0283
       Total |  1.0516e+09     2,999  350656.887   Root MSE        =    583.73

------------------------------------------------------------------------------
 birthweight | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      smoker |  -253.2284   26.95149    -9.40   0.000    -306.0736   -200.3831
       _cons |    3432.06    11.8709   289.12   0.000     3408.784    3455.336
------------------------------------------------------------------------------

. 
. /*Children of smoking mothers weight on average ~253 grams less than children of
> non smokers.*/
. 
. *Question 3*
. reg birthweight smoker age educ

      Source |       SS           df       MS      Number of obs   =     3,000
-------------+----------------------------------   F(3, 2996)      =     35.26
       Model |  35865384.5         3  11955128.2   Prob > F        =    0.0000
    Residual |  1.0158e+09     2,996  339036.922   R-squared       =    0.0341
-------------+----------------------------------   Adj R-squared   =    0.0331
       Total |  1.0516e+09     2,999  350656.887   Root MSE        =    582.27

------------------------------------------------------------------------------
 birthweight | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      smoker |  -226.8282   27.67183    -8.20   0.000    -281.0859   -172.5705
         age |   3.735851   2.217288     1.68   0.092    -.6117092    8.083412
        educ |   14.99989   5.583899     2.69   0.007     4.051221    25.94855
       _cons |   3132.882   73.39099    42.69   0.000      2988.98    3276.783
------------------------------------------------------------------------------

. 
. /*Yes, the smoking coeffecient becomes smaller. Age and education both increase
> birthweight slightly.*/
. 
. *Question 4*
. logit unmarried birthweight smoker

Iteration 0:  Log likelihood = -1605.6515  
Iteration 1:  Log likelihood = -1491.6145  
Iteration 2:  Log likelihood = -1487.2855  
Iteration 3:  Log likelihood = -1487.2841  
Iteration 4:  Log likelihood = -1487.2841  

Logistic regression                                     Number of obs =  3,000
                                                        LR chi2(2)    = 236.73
                                                        Prob > chi2   = 0.0000
Log likelihood = -1487.2841                             Pseudo R2     = 0.0737

------------------------------------------------------------------------------
   unmarried | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
 birthweight |  -.0006944   .0000766    -9.06   0.000    -.0008446   -.0005442
      smoker |   1.116637   .1013797    11.01   0.000     .9179365    1.315338
       _cons |   .8011541   .2580066     3.11   0.002     .2954704    1.306838
------------------------------------------------------------------------------

. 
. 
. reg birthweight 

      Source |       SS           df       MS      Number of obs   =     3,000
-------------+----------------------------------   F(0, 2999)      =      0.00
       Model |           0         0           .   Prob > F        =         .
    Residual |  1.0516e+09     2,999  350656.887   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  1.0516e+09     2,999  350656.887   Root MSE        =    592.16

------------------------------------------------------------------------------
 birthweight | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   3382.934   10.81137   312.91   0.000     3361.735    3404.132
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/annajensen/Documents/GitHub/PB4A7_Practice/Seminar_4/Seminar_3.log
  log type:  text
 closed on:  30 Oct 2024, 15:00:00
-----------------------------------------------------------------------------------------------------------------------------------------
